# Basics of Pandas And NumPy

### First import numpy and pandas (you cannot use pandas without numpy)

In [9]:
import pandas as pd
import numpy as num

#### Write a simple dictionary code in python
- Dataframe is simply display of data in tabular form

In [4]:
dct ={
 "name" : [ 'anns', 'sahil', 'hamza'],
    "marks" : [ 74,76,79 ]
}

df = pd.DataFrame(dct)

#### Display by simply calling the variable

In [5]:
df

    name  marks
0   anns     74
1  sahil     76
2  hamza     79

### Display of specific rows
- Show the ending rows with 'tail(number of rows)' function
- Show the starting rows with 'head(number of rows)' function

In [6]:
df.tail(1)

    name  marks
2  hamza     79

### Describe Function
- it caculates the following calculations for all the numerical columns of the table

In [8]:
df.describe()

           marks
count   3.000000
mean   76.333333
std     2.516611
min    74.000000
25%    75.000000
50%    76.000000
75%    77.500000
max    79.000000

In [10]:
df

    name  marks
0   anns     74
1  sahil     76
2  hamza     79

In [13]:
df['name']

0     anns
1    sahil
2    hamza
Name: name, dtype: object

In [14]:
df['name'][0]

'anns'

In [15]:
df['name'][0] = 77

C:\Users\hp\AppData\Local\Temp\ipykernel_7268\3572070170.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 77

In [16]:
df

    name  marks
0     77     74
1  sahil     76
2  hamza     79